Repository: huwung/ProjektOmegaT
Catalog: svenska2english/svenska-level1.tmx
Source language: sv
Languages: en

source: How OmegaT works
en: Arbetsflöde i OmegaT

source: It is free software originally developed by Keith Godfrey in 2000, and is currently developed by a team led by Didier Briel.
en: Det är ett fritt program ursprungligen utvecklat år 2000 av Keith Godfrey och utvecklas nu av en grupp ledd av Didier Briel.

source: OmegaT is a computer-assisted translation tool written in the Java programming language.
en: OmegaT är ett datorbaserat översättningsverktyg skrivet i Java.

source: OmegaT runs on Linux, Mac OS X and Microsoft Windows 98 SE or higher,[1] and requires Java 1.5.
en: Det kräver Java 1.5, vilket finns tillgängligt för Linux, Mac OS X och Microsoft Windows 98 SE och senare.

source: Sammansättningar: vätebombsexperiment.
en: compositions: hydrogen bomb experiment.

source: ett längdmått
en: 10 kilometer

source: experimentell.
en: experimental.

source: han kanske kommer, men å andra sidan kanske han inte gör det.
en: he might come, and then again he might not.

source: han är åtskilligt yngre än sin bror
en: he is a good deal younger than his brother

source: i förskott
en: in advance

source: många är emot medicinska experiment på människor.
en: many people are against medical experiments on humans.

source: smått exotisk
en: quite exotic

source: tankeexperiment.
en: intellectual experiment.

source: verksamheten har redan startat så smått
en: business has already got under way on a small scale

source: vätebombsexperiment.
en: hydrogen bomb experiment.
